# TKS and TKGI are installed from https://network.pivotal.io/products/pivotal-container-service/

tap "cloudfoundry/tap"
tap "git-duet/tap"
tap "golangci/tap"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "k14s/tap"
tap "pivotal-cf/kiln", "https://github.com/pivotal-cf/kiln"
tap "pivotal-cf/om", "https://github.com/pivotal-cf/om"
tap "pivotal/tap"

brew "automake"
brew "awscli"
brew "bbl"
brew "bison"
brew "cfssl"
brew "chruby"
brew "cloudfoundry/tap/bosh-cli"
brew "cloudfoundry/tap/cf-cli@7"
brew "cloudfoundry/tap/credhub-cli"
brew "cmake"
brew "dependency-check"
brew "direnv"
brew "fasd"
brew "fd"
brew "git"
brew "git-duet/tap/git-duet"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "golangci/tap/golangci-lint"
brew "govc"
brew "htop"
brew "hub"
brew "hugo"
brew "jq"
brew "k14s/tap/kapp"
brew "k14s/tap/kbld"
brew "k14s/tap/vendir"
brew "k14s/tap/ytt"
brew "kiln"
brew "kubectl"
brew "lastpass-cli"
brew "libdvdcss"
brew "libyaml"
brew "mysql"
brew "neovim"
brew "node@12"
brew "node@14"
brew "nodeenv"
brew "npm"
brew "om"
brew "openssl"
brew "pivnet-cli"
brew "postgresql@11"
brew "python3"
brew "qrencode"
brew "readline"
brew "ripgrep"
brew "ruby-install"
brew "sshuttle"
brew "terraform"
brew "the_silver_searcher"
brew "tidy-html5"
brew "tmux"
brew "tree"
brew "uaa-cli"
brew "vim"
brew "watch"
brew "wget"
brew "wireguard-go"
brew "wireguard-tools"
brew "yarn"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "zsh-lovers"
brew "zsh-syntax-highlighting"

cask "adoptopenjdk8"
cask "battle-net"
cask "discord"
cask "docker"
cask "fantasy-grounds"
cask "firefox"
cask "flycut"
cask "gimp"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-cloud-sdk"
cask "handbrake"
cask "inkscape"
cask "istat-menus"
cask "iterm2"
cask "jetbrains-toolbox"
cask "makemkv"
cask "sequel-pro-nightly"
cask "signal"
cask "skype"
cask "slack"
cask "spectacle"
cask "spotify"
cask "steam"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "wireshark"
cask "xquartz"
cask "zoom"
